# 7. Написати скрипт, який отримає максимальне і мінімальне значення із словника. Дані захардкодити.
#                Приклад словника (можете використовувати свій):
#                dict_1 = {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}
#                Вихідний результат:
#                MIN: 10
#                MAX: 60

dict = {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60, 7: 1090, 8 : -1, 9 : 70}
list_of_values = dict.values()

print("MIN: " + str(min(list_of_values)))
print("MAX: " + str(max(list_of_values)))